# vi: ft=text

# zsh sensible
sorin-ionescu/prezto	path:modules/directory
sorin-ionescu/prezto	path:modules/environment
sorin-ionescu/prezto	path:modules/history

# Prompt
zdharma-continuum/fast-syntax-highlighting
jeffreytse/zsh-vi-mode

romkatv/powerlevel10k	kind:fpath

# Completions
romkatv/zsh-defer
sorin-ionescu/prezto	kind:clone path:modules/completion
ogham/exa				kind:fpath path:completions/zsh
sharkdp/fd 				kind:fpath path:contrib/completion
itchyny/gojq 			kind:fpath
BurntSushi/ripgrep 		kind:fpath path:complete

conda-incubator/conda-zsh-completion 	kind:fpath
