# vi: ft=text

# Thanks mattmc3 for "zsh sensible"
mattmc3/zephyr path:plugins/colors
mattmc3/zephyr path:plugins/environment
mattmc3/zephyr path:plugins/directory
mattmc3/zephyr path:plugins/history

# Base
jeffreytse/zsh-vi-mode
romkatv/powerlevel10k kind:fpath

# Autoloading of my configs
mattmc3/zshrc.d
mattmc3/zfunctions

# Actual plugins
zdharma-continuum/fast-syntax-highlighting
Cloudstek/zsh-plugin-appup
xorkevin/code-review-zsh
aperezdc/zsh-notes

# Additional Completions
zsh-users/zsh-completions

# Load/cache Completions
mattmc3/zephyr path:plugins/completions
