# vi: ft=text

# zsh sensible
mattmc3/zephyr			path:plugins/directory
belak/zsh-utils			path:history
# This fork/branch fixes the issue where lines get eaten in normal mode
# https://github.com/jeffreytse/zsh-vi-mode/pull/180
#jeffreytse/zsh-vi-mode
scresante/zsh-vi-mode	branch:fixpacman

# Theme
romkatv/powerlevel10k kind:fpath

# Actual plugins
zdharma-continuum/fast-syntax-highlighting
Cloudstek/zsh-plugin-appup
xorkevin/code-review-zsh
aperezdc/zsh-notes

# Completions
zsh-users/zsh-completions
BurntSushi/ripgrep 			kind:fpath path:complete
sharkdp/fd 					kind:fpath path:contrib/completion
itchyny/gojq 				kind:fpath
ogham/exa					kind:fpath path:completions/zsh
aws/aws-cli					kind:clone
belak/zsh-utils 			path:completion

# Autoloading
mattmc3/zephyr	path:plugins/confd
mattmc3/zephyr	path:plugins/zfunctions
